frontend/controllers/SiteController.php

    public function actionCategory(){

        $model = Category::find()->all();
---
SELECT * FROM `category`

    public function actionProduct($id){


        $model = new ActiveDataProvider([
    'query' => Product::find()->where(['category_id'=>$id])->all()
        ]);
---
SELECT * FROM `product` WHERE `category_id`='2'